docs: translate tech spec to English
